In [3]:
import pandas as pd
data = [1,2,3,4,5,6,7,8,9,10]

series = pd.Series(data)
print("Series \n",series)

print(type(series))

Series
 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
# Creating series from dictionary
data = {'a':1,"b":2,'c':3,'d':4,'e':5}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
data = [10,20,30,40,50,60,70,80,90]
indices = ['a','b','c','d','e','f','g','h','i']
pd.Series(data,index = indices)

a    10
b    20
c    30
d    40
e    50
f    60
g    70
h    80
i    90
dtype: int64

In [6]:
#Dataframe
# Create a Dataframe from a dictionary of list
data = {
    'Name':['Rajib','Lotus','Padma'],
    'Age':[23,22,26],
    'City':['Marspore','Plutofield','Earthshire']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age        City
0  Rajib   23    Marspore
1  Lotus   22  Plutofield
2  Padma   26  Earthshire
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['Rajib', 23, 'Marspore'],
       ['Lotus', 22, 'Plutofield'],
       ['Padma', 26, 'Earthshire']], dtype=object)

In [23]:
#Create a DataFrame from a list of Dictionaries
import pandas as pd
data = [
    {'Name':'Rajib','Age':23,'City':'na'},
    {'Name':'Debian','Age':24,'City':'na1'},
    {'Name':'Kali','Age':25,'City':'na2'},
    {'Name':'Ubuntu','Age':26,'City':'na3'}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age City
0   Rajib   23   na
1  Debian   24  na1
2    Kali   25  na2
3  Ubuntu   26  na3
<class 'pandas.core.frame.DataFrame'>

In [20]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [22]:
df.tail(3)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [24]:
# Accessting Data from DataFrame

df

     Name  Age City
0   Rajib   23   na
1  Debian   24  na1
2    Kali   25  na2
3  Ubuntu   26  na3

In [28]:
df['Name']

0     Rajib
1    Debian
2      Kali
3    Ubuntu
Name: Name, dtype: object

In [29]:
type(df['Name'])

pandas.core.series.Series

In [37]:
df.loc[0]

Name    Rajib
Age        23
City       na
Name: 0, dtype: object

In [35]:
df.iloc[0,0]

'Rajib'

In [38]:
df

     Name  Age City
0   Rajib   23   na
1  Debian   24  na1
2    Kali   25  na2
3  Ubuntu   26  na3

In [39]:
# Accessing a specified element
df.at[1,'City']

'na1'

In [40]:
#Accessing a specified element using iat

df.iat[2,2]

'na2'

In [ ]:
#Data Manipulation with DataFrame
## Adding a column
df['Salary'] = [50000,60000,70000,75000]
df

     Name  Age City  Salary
0   Rajib   23   na   50000
1  Debian   24  na1   60000
2    Kali   25  na2   70000
3  Ubuntu   26  na3   75000

In [45]:
#Remove a column
df.drop('City',axis = 1,inplace = True)

In [46]:
df

     Name  Age  Salary
0   Rajib   23   50000
1  Debian   24   60000
2    Kali   25   70000
3  Ubuntu   26   75000

In [47]:
df['Age'] = df['Age'] + 1
df

     Name  Age  Salary
0   Rajib   24   50000
1  Debian   25   60000
2    Kali   26   70000
3  Ubuntu   27   75000

In [48]:
df.drop(3,inplace = True)

In [49]:
df

     Name  Age  Salary
0   Rajib   24   50000
1  Debian   25   60000
2    Kali   26   70000

In [57]:
print("Data types:\n",df.dtypes)

Data types:
 Name      object
Age        int64
Salary     int64
dtype: object

In [58]:
df.describe()

        Age   Salary
count   3.0      3.0
mean   25.0  60000.0
std     1.0  10000.0
min    24.0  50000.0
25%    24.5  55000.0
50%    25.0  60000.0
75%    25.5  65000.0
max    26.0  70000.0